#+startup: beamer
#+title: Advanced mixed-models workshop: Session 3
#+author: Dale Barr
#+email: dale.barr@glasgow.ac.uk
#+date: Bremen March 2015
#+OPTIONS: toc:nil H:2 ^:nil
#+LATEX_CLASS: beamer
#+LATEX_CLASS_OPTIONS: []
#+BEAMER_THEME: Boadilla
#+LATEX_HEADER: \makeatletter \def\verbatim{\scriptsize\@verbatim \frenchspacing\@vobeyspaces \@xverbatim} \makeatother

#+BEAMER_COLOR_THEME: seahorse
#+LATEX_HEADER: \definecolor{lgray}{rgb}{0.90,0.90,0.90}
#+LATEX_HEADER: \beamertemplatenavigationsymbolsempty
#+LATEX_HEADER: \usemintedstyle{tango}
#+LATEX_HEADER: \institute{University of Glasgow}

#+COLUMNS: %40ITEM %10BEAMER_env(Env) %9BEAMER_envargs(Env Args) %4BEAMER_col(Col) %10BEAMER_extra(Extra)

#+PROPERTY: header-args:R :session *R* :exports both :results output :tangle session_03.R

** View results

#+BEGIN_SRC R :exports results :eval never
  summary(mod_diag)
#+END_SRC

#+RESULTS:
#+begin_example
Linear mixed model fit by maximum likelihood  ['lmerMod']
Formula: RTt ~ T * (V1 + V2) + ((1 | SessionID) + (0 + T | SessionID) +  
    (0 + V1 | SessionID) + (0 + V2 | SessionID) + (0 + T:V1 |  
    SessionID) + (0 + T:V2 | SessionID)) + ((1 | ItemID) + (0 +  
    T | ItemID) + (0 + V1 | ItemID) + (0 + V2 | ItemID) + (0 +  
    T:V1 | ItemID) + (0 + T:V2 | ItemID)) + (1 | SessionID:ItemID)
   Data: fan

     AIC      BIC   logLik deviance df.resid 
187510.1 187657.1 -93735.0 187470.1    11500 

Scaled residuals: 
    Min      1Q  Median      3Q     Max 
-2.8900 -0.6175 -0.1114  0.4791  4.4215 

Random effects:
 Groups           Name        Variance Std.Dev.
 SessionID.ItemID (Intercept) 110838   332.92  
 ItemID           T:V2             0     0.00  
 ItemID.1         T:V1             0     0.00  
 ItemID.2         V2           13313   115.38  
 ItemID.3         V1           21559   146.83  
 ItemID.4         T                0     0.00  
 ItemID.5         (Intercept)  47686   218.37  
 SessionID        T:V2             0     0.00  
 SessionID.1      T:V1          2430    49.29  
 SessionID.2      V2               0     0.00  
 SessionID.3      V1               0     0.00  
 SessionID.4      T            50682   225.13  
 SessionID.5      (Intercept) 332480   576.61  
 Residual                     580290   761.77  
Number of obs: 11520, groups:  
SessionID:ItemID, 1920; ItemID, 96; SessionID, 20

Fixed effects:
            Estimate Std. Error t value
(Intercept)  2439.20     131.26  18.583
T            -249.28      52.30  -4.766
V1            -14.25      22.95  -0.621
V2             12.60      21.00   0.600
T:V1           62.94      36.47   1.725
T:V2           28.77      34.77   0.827

Correlation of Fixed Effects:
     (Intr) T     V1    V2    T:V1 
T    0.000                         
V1   0.000  0.000                  
V2   0.000  0.000 0.314            
T:V1 0.000  0.000 0.000 0.000      
T:V2 0.000  0.000 0.000 0.000 0.477
#+end_example

